[
  {
    "icon": "🧑‍💻",
    "title": "Perfil Profesional",
    "content": "Desarrollador Web Full Stack especializado en el ecosistema JavaScript, con amplia experiencia en el desarrollo de soluciones modernas, escalables e impulsadas por inteligencia artificial. Me defino como un profesional comprometido con la innovación, el aprendizaje constante y la creación de soluciones que integran tecnología, pensamiento crítico y creatividad."
  },
  {
    "icon": "🚀",
    "title": "Tecnologías Front-end",
    "content": "Lenguajes y frameworks como JavaScript y TypeScript forman la base de mi trabajo, con experiencia sólida en React y Next.js. En cuanto a estilos y diseño de interfaz, manejo herramientas como Bootstrap, Tailwind CSS, HTML, CSS y SASS. Además, aplico buenas prácticas centradas en la accesibilidad, el rendimiento y el diseño responsivo."
  },
  {
    "icon": "🔧",
    "title": "Back-end y Base de Datos",
    "content": "Tengo experiencia sólida en desarrollo Back-end utilizando Node.js y Express, así como en la integración de servicios con Firebase. Trabajo con bases de datos relacionales como MySQL y no relacionales como MongoDB, adaptándome a las necesidades específicas de cada proyecto. Además, me especializo en el diseño e implementación de APIs REST seguras, asegurando una autenticación robusta y una gestión eficiente de los datos para garantizar rendimiento, escalabilidad y protección de la información."
  },
  {
    "icon": "☁️",
    "title": "Infraestructura y Despliegue",
    "content": "Tengo experiencia desplegando y gestionando aplicaciones en plataformas como Vercel y AWS, utilizando servicios clave como EC2, S3, Lambda y RDS. Trabajo con herramientas modernas como funciones serverless, middleware en el edge e ISR (Incremental Static Regeneration) para optimizar el rendimiento y la escalabilidad. Además, implemento prácticas DevOps como la integración y el despliegue continuo (CI/CD), la automatización de flujos de desarrollo y el monitoreo constante, asegurando procesos eficientes y confiables en todo el ciclo de vida del software."
  },
  {
    "icon": "🤖",
    "title": "Integración con IA",
    "content": "Diseño e implemento soluciones basadas en inteligencia artificial para potenciar la experiencia del usuario, automatizar tareas y extraer valor de los datos. Integro APIs de IA generativa y modelos de procesamiento de lenguaje natural (NLP), adaptando cada tecnología a las necesidades específicas de cada proyecto para lograr resultados más inteligentes, eficientes y personalizados."
  },
  {
    "icon": "🎙️",
    "title": "Divulgación y Arte",
    "content": "Soy conductor de un podcast dedicado a la ciencia y la filosofía, donde abordo ideas complejas con un enfoque crítico pero accesible para todo público. Además, cultivo mi pasión por el arte y la escritura, desarrollando proyectos personales que incluyen dibujo y la creación de relatos y cuentos, combinando creatividad y reflexión en cada obra."
  },
  {
    "icon": "🎓",
    "title": "Docencia Universitaria",
    "content": "Soy profesor de programación en la Universidad Tecnológica Nacional (UTN), donde formo a estudiantes en los fundamentos del desarrollo web, fomentando el pensamiento lógico y promoviendo las mejores prácticas de programación para prepararlos como profesionales competentes y creativos en el mundo tecnológico."
  }
]